import java.util.Date; 
 
public class CristmasTree {
    public static void main(String args[]) {
      try
      {
        System.out.println("          *");
        
        Thread.sleep(1000);   
        
        System.out.println("         ** ");
        
        Thread.sleep(1000);   
        
        System.out.println("        *o* "); 
        
        Thread.sleep(1000);   
        
        System.out.println("       *☺*o* ");
        
        Thread.sleep(1000);   
        
        System.out.println("      ***o*** ");
        
        Thread.sleep(1000);   
        
        System.out.println("     **o**😀*o* ");
        
        Thread.sleep(1000);   
        
        System.out.println("    **😀**o**o** ");
        
        //Perche ai letto fino a questo punto?
        
        Thread.sleep(1000);   
        
        System.out.println("   **o**😀***😀*o* ");
        
        Thread.sleep(1000);   
        
        System.out.println("  *****😀*o**o**** ");
        
        Thread.sleep(1000);   
        
        System.out.println(" **😀**o*****o**😀** ");
        
        Thread.sleep(1000);   
        
        System.out.println("******o*****😀**o***");
        
        Thread.sleep(1000);   
        
        System.out.println("****o***😀**o***o***😀* ");
        
        System.out.println("     ____!_!____ ");
        System.out.println("███╗░░░███╗███████╗██████╗░██████╗░██╗░░░██╗  ░█████╗░██╗░░██╗██████╗░██╗░██████╗███╗░░░███╗░█████╗░░██████╗\n" +
"████╗░████║██╔════╝██╔══██╗██╔══██╗╚██╗░██╔╝  ██╔══██╗██║░░██║██╔══██╗██║██╔════╝████╗░████║██╔══██╗██╔════╝\n" +
"██╔████╔██║█████╗░░██████╔╝██████╔╝░╚████╔╝░  ██║░░╚═╝███████║██████╔╝██║╚█████╗░██╔████╔██║███████║╚█████╗░\n" +
"██║╚██╔╝██║██╔══╝░░██╔══██╗██╔══██╗░░╚██╔╝░░  ██║░░██╗██╔══██║██╔══██╗██║░╚═══██╗██║╚██╔╝██║██╔══██║░╚═══██╗\n" +
"██║░╚═╝░██║███████╗██║░░██║██║░░██║░░░██║░░░  ╚█████╔╝██║░░██║██║░░██║██║██████╔╝██║░╚═╝░██║██║░░██║██████╔╝\n" +
"╚═╝░░░░░╚═╝╚══════╝╚═╝░░╚═╝╚═╝░░╚═╝░░░╚═╝░░░  ░╚════╝░╚═╝░░╚═╝╚═╝░░╚═╝╚═╝╚═════╝░╚═╝░░░░░╚═╝╚═╝░░╚═╝╚═════╝░");
      }
      catch(InterruptedException ex)
      {
          ex.printStackTrace();
      }
    }
}